blog/30.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-16 Sun 23:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>3.5.2 Infinite Streams</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">3.5.2 Infinite Streams
<br />
<span class="subtitle">2024-05-19 Sun</span>
</h1>
<ul class="org-ul">
<li>We can use streams to represent <i>infinite</i> sequences.</li>

<li><p>
For example, this is the definition of the stream of positive
integers:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">integers-starting-from</span> n)
  (cons-streams n (integers-starting-from (+ n 1))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">integers</span> (integers-starting-from n))
</pre>
</div>

<p>
``Our programs will never know that the entire infinite stream is
not there.''
</p></li>

<li><p>
We can now define other infinite streams based on this one, e.g.:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">divisible?</span> x y) (= (remainder x y) 0))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">no-sevens</span> <span style="color: #595959;">;; </span><span style="color: #595959;">streams of integers that are not divisible by 7</span>
  (stream-filter (<span style="color: #531ab6;">lambda</span> (x) (not (divisible? x 7)))
                 integers))

(stream-ref no-sevens 100)
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 117</span>
</pre>
</div></li>

<li>Authors show the analog way to define the infinite streams of
Fibonacci numbers.</li>

<li>Authors show the method, known as the ``sieve of Eratosthenes'', to
construct the infinite streams of prime numbers.</li>

<li><p>
<code>integers</code> is
</p>
<blockquote>
<p>
defined by specifying ``generating'' procedures that explicitly
compute the stream elements one by one. An alternative way to
specify streams is to take advantage of delayed evaluation to define
streams implicitly. (328)
</p>
</blockquote></li>

<li><p>
Here is an infinite streams of ones:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">ones</span> (cons-stream 1 ones))
</pre>
</div></li>

<li><p>
Consider the following operation, which uses the generalized version
of <code>stream-map</code> from exercise 3.50:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-stream</span> s1 s2)
  (stream-map + s1 s2))
</pre>
</div></li>

<li><p>
Now <code>integers</code> can be defined as follows:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">integers</span> (cons-stream 1 (add-streams ones integers)))
</pre>
</div></li>
</ul>

<div id="outline-container-org331999d" class="outline-2">
<h2 id="org331999d">Exercise 3.53</h2>
<div class="outline-text-2" id="text-org331999d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Without running the program, describe the elements of the stream
defined by
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">s</span> (cons-stream 1 (add-streams s s)))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The elements of the streams are the powers of 2.
</p>

<p>
<code>s</code> is the list whose <code>car</code> is 1 and whose <code>cdr</code> is the promise to
execute <code>(add-stream s s)</code>.
</p>

<p>
Forcing the <code>cdr</code> of <code>s</code> gives us the list whose <code>car</code> is 2 and whose
<code>cdr</code> is the promise to execute <code>(add-stream (stream-cdr s)
(stream-cdr s))</code>.
</p>

<p>
Forcing the <code>cdr</code> of the <code>cdr</code> of <code>s</code> gives us the list whose car is 4
and whose <code>cdr</code>&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
